WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calib_lsi_clock.c
//=============================================================
// This function returns a value that is set here
uint32_t pwrmgmt_get_lsi_calib_rtc_clk_value()
{
  return _lsiRtcPrer;
}

//=============================================================
#if PWRMGMT_CLK_SHOW_RTC_TIME_FOR_TESTING > 0
// This allows the test code to be notified when the RTC source clock has
// been changed.
void pwrmgmt_set_dbg_clk_switched_flag(bool dbgClkSwitched)
{
  _dbgClkSwitched = dbgClkSwitched;
}

#endif

//=============================================================
// This ISR is only used to measure the LSI frequency for a moment
static int pwrmgmt_lsi_use_isr_lsi_clock(int irq, void *context, void *arg)
{  
  uint16_t timStatusReg = getreg16(STM32_TIM5_SR);

  // Get interrupt on rising edge
  if(timStatusReg & GTIM_SR_CC4IF)
  {
    timStatusReg &= ~GTIM_SR_CC4IF;
  
    uint32_t currentCount = getreg32(STM32_TIM5_CCR4);

    // Roll over? If it did ignore data
    if(currentCount > _prevISRCount)
    {
      // No, didn't roll over save count for non-isr processing
      _elapsedCount = currentCount - _prevISRCount;
    }

    _prevISRCount = currentCount;
  }

  putreg16(timStatusReg, STM32_TIM5_SR);
  return OK;
}

//=============================================================
// Enable timer 5 for calibration
static void pwrmgmt_lsi_enable_timer_5(void)
{
  uint16_t cr1Val = getreg16(STM32_TIM5_CR1);
  cr1Val |= GTIM_CR1_CEN;
  
  uint16_t egrVal = getreg16(STM32_TIM5_EGR);
  egrVal |= GTIM_EGR_UG;

  putreg16(egrVal, STM32_TIM5_EGR);
  putreg16(cr1Val, STM32_TIM5_CR1);
}

//=============================================================
// Disable timer 5 for calibration
static void pwrmgmt_lsi_disable_timer_5(void)
{
  uint16_t regval = getreg16(STM32_TIM5_CR1);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, STM32_TIM5_CR1);
}

//====================================================================
// This function is called during startup. It is responsible for finding the
// LSI clock frequency and the needed factors for calibrating the RTC hardware.
// This function creates a thread so the rest of the initialization
// isn't stalled waiting for this to finish. Why not do this on demand? Because
// this requires Timer 5 to be setup a special way. And at runtime timer 5 has
// other responsibilites.
int pwrmgmt_init_lsi_calib(void)
{
  int ret;

  _lsiRtcPrer = 0;

#if PWRMGMT_CLK_SHOW_RTC_TIME_FOR_TESTING > 0
  _dbgClkSwitched = false;
#endif

  // This call will initialize and enable timer 5 which is the only one that
  // can be used to measure the LSI's frequency. It will also turn-on the LSI
  // clock.
  ret = pwrmgmt_lsi_init_timer_5_for_measuring();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI init TIM5 failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }

  // Create a thread to do the calibration work. The results will be stored in
  // a battery backed register.
  ret = pwrmgmt_create_lsi_calc_thread();
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI calc freq failed:%d\n", thisFile, __LINE__, ret);
    return ret;
  }
  
  return ret;
}

//=====================================================================
// Create a thread to do the early initialization
int pwrmgmt_create_lsi_calc_thread()
{
  // Create a thread to use for experimenting
  _pwrmgmt_lsi_calc_thread_id = kthread_create(PWRMGMT_CAL_LSI_THREAD_NAME,
                                  PWRMGMT_CAL_LSI_THREAD_PRIORITY,
                                  PWRMGMT_CAL_LSI_THREAD_STACKSIZE,
                                  (main_t) pwrmgmt_lsi_calc_prep_thread_func,
                                  (char *const *) NULL);
  if (_pwrmgmt_lsi_calc_thread_id <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              thisFile, __LINE__, PWRMGMT_CAL_LSI_THREAD_NAME);
    return -ENOEXEC;
  }

  return OK;
}

//=============================================================
// This thread function will calculate the calibration needed for the LSI
// clocks timing error. It is called before entering the low-power mode.
void *pwrmgmt_lsi_calc_prep_thread_func(int argc, char *argv[])
{
  int ret;
  double lsiMeasuredFreq;
  uint8_t PreDivA = 0;
  uint16_t PreDivS = 0;
  uint32_t rtcPrer;

  // Under some undetermined conditions RTC pre-scaler could become 0x007f00ff
  // while Nuttx is using the HSE clock. A 0x007f00ff is the correct
  // pre-scaler for LSE clock, which we cannot use. Meaning that this
  // pre-scaler value is way wrong! This patch corrects this error.
  rtcPrer = getreg32(STM32_RTC_PRER);
  if(rtcPrer == 0x007f00ff)
  {
    MEADOW_TRACE_DEBUG("At startup detected wrong pre-scaler:0x%08x\n", rtcPrer);

    // Unlock RTC registers
    rtc_wprunlock();
    ret = rtc_enterinit();
    if(ret == -ETIMEDOUT)
    {
      syslog(LOG_ERR, "%s@%d-STARTUP->RTC INIT state timed out\n", thisFile, __LINE__);
      return NULL;
    }

    // Hardcoded HSE pre-scaler values.
    rtcPrer = (uint32_t)PWRMGMT_CLK_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
               (uint32_t)PWRMGMT_CLK_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
    putreg32(rtcPrer, STM32_RTC_PRER);

    rtc_exitinit();
    rtc_wprlock();
  }

#if defined(USE_MEADOW_DEBUG_HELPERS)
  uint32_t clkSrc = getreg32(STM32_RCC_BDCR) & RCC_BDCR_RTCSEL_MASK;
  uint32_t rtcPRER = getreg32(STM32_RTC_PRER);
  uint32_t rtcPrerDBG = (uint32_t)PWRMGMT_CLK_HSE_DIV_S_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_S_SHIFT |
                (uint32_t)PWRMGMT_CLK_HSE_DIV_A_FACTOR_FOR_1_MHZ << RTC_PRER_PREDIV_A_SHIFT;
  MEADOW_TRACE_DEBUG(">>> At startup, clkSrc:0x%08x, rtc pre-scaler:0x%08x and HSE default:0x%08x\n",
            clkSrc, rtcPRER, rtcPrerDBG);
#endif

  ret = pwrmgmt_lsi_calculate_lsi_clock_freq(&lsiMeasuredFreq);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-LSI clock average error\n", thisFile, __LINE__);
    return NULL;
  }

  // Finshed with Timer 5
  up_disable_irq(STM32_IRQ_TIM5);

  pwrmgmt_lsi_disable_timer_5();

