WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/pwrmgmt/pwrmgmt_calib_lsi_clock.c
  // Enable the timer input capture, which was disabled earlier
  // but only for channel 4
  regVal16 = getreg16(STM32_TIM5_CCER);
  regVal16 |= ( GTIM_CCER_CC4E); // bit 12
  putreg16(regVal16, STM32_TIM5_CCER);

  // Clear all interrupt sources and set the ones we need in the DMA/Interrupt
  // enable register (DIER). Note: Advanced timers 1 & 8 add ATIM_DIER_COMIE,
  // ATIM_DIER_BIE and ATIM_DIER_COMDE
  modifyreg16(STM32_TIM5_BASE + STM32_GTIM_DIER_OFFSET, 
          GTIM_DIER_TDE   | GTIM_DIER_CC4DE | GTIM_DIER_CC3DE | GTIM_DIER_CC2DE |
          GTIM_DIER_CC1DE | GTIM_DIER_UDE   | GTIM_DIER_TIE   | GTIM_DIER_CC4IE |
          GTIM_DIER_CC3IE | GTIM_DIER_CC2IE | GTIM_DIER_CC1IE | GTIM_DIER_UIE,
          GTIM_DIER_CC4IE);

  // Interupts are handled by isr
  ret = irq_attach(STM32_IRQ_TIM5, pwrmgmt_lsi_use_isr_lsi_clock, NULL);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-irq_attach failed:%d, errno:%d\n",
          thisFile, __LINE__, ret, errno);
    return ret;
  }

  up_enable_irq(STM32_IRQ_TIM5);

  pwrmgmt_lsi_enable_timer_5();

  // To test enable the Low-Speed Internal (LSI) RC Oscillator by setting
  // the LSION bit the RCC CSR register.
  // Note: this clock runs even when it is not needed. Why? It only draws
  // 0.6 micro amps max. while running.
  modifyreg32(STM32_RCC_CSR, 0, RCC_CSR_LSION);

  // Wait for the internal RC oscillator to become stable
  while ((getreg32(STM32_RCC_CSR) & RCC_CSR_LSIRDY) == 0);

  return OK;
}

//================================================================
// This function will measure the frequency of the LSI clock using the
//  data via Timer5's ISR
int pwrmgmt_lsi_calculate_lsi_clock_freq(double *lsiMeasuredFreq)
{
  static uint32_t freqCount;
  static uint32_t isrCount = 0;
  static uint64_t totCount = 0;

  // Measure the clock frequency x times, waiting y usec
  for (freqCount = 0; freqCount < PWRMGMT_CLK_CAL_MEASURE_CLK_COUNT; freqCount++)
  {
    // Pause a moment
    usleep(PWRMGMT_CLK_CAL_MEASURE_CLK_DELAY);

    // Ignore possibly bad values. Warning: this loop will never exit if there
    // are no ISR interrupts.
    for ( ; ; )
    {
      // We should not have the same count as last time
      if(isrCount != _elapsedCount)
      {
        // Get a valid ISR count value
        isrCount = _elapsedCount;
        break;
      }
    }

    totCount += isrCount;
  }

  // Since we know the clock frequency of Timer 5 and the average number of
  // counts between the LSI clock's rising edges we have everything we need.
  *lsiMeasuredFreq = (double)(PWRMGMT_CLK_TIMER_5_BASE_CLOCK_FREQ) / (double) (totCount/freqCount);
  
  MEADOW_TRACE_DEBUG("LSI Average Frequency:%06.03f\n", *lsiMeasuredFreq);

  return OK;
}

//================================================================
// In STMicro's AN4759 Rev 7 section 2.1.4 there is a brief section on
// adjusting the RTC clock to match the input frequency of the reference
// clock, LSI in our case. There are 2 factors needed and the product
// of these 2 factors equal the frequency being measured. Doing this will
// result in a RTC clock frequency of 1 Hz.
// The following code finds these 2 factors, however, the factors needed by
// the MCU's hardware needs both factors to be 1 less than calculated.
int pwrmgmt_lsi_calc_rtc_prescaler_values(double lsiMeasuredFreq,
          uint8_t *PreDivA, uint16_t *PreDivS)
{
  // int ret;
  uint8_t preDivA;
  uint16_t initialPreDivS;
  uint16_t chkOffset;
  uint16_t chkDiff = 0xffff;
  uint16_t smallestDiff = 0xffff;
  uint8_t smallestDivA = 127;
  uint16_t smallestDivS = 255;
  uint16_t lsiTargetFreq = (uint32_t)round(lsiMeasuredFreq);

   MEADOW_TRACE_DEBUG("Entered Find Pre-scaler value() lsiMeasuredFreq:%.3f as uint32:%lu\n",
          lsiMeasuredFreq, lsiTargetFreq);

  // LSI frequency already perfect?
  if(lsiMeasuredFreq == (double)PWRMGMT_CLK_CAL_TARGET_FREQUENCY)
  {
    // Use the default values
     MEADOW_TRACE_DEBUG("**Perfect:%u**\n", lsiMeasuredFreq);
    *PreDivA = 127;
    *PreDivS = 255;
    return OK;
  }

  // We'll solve this with 2 loops. The outer loop counts from 127 (PREDIVA)
  // to 1 and the inner loop for the PREDIVS, which is typically around 512. The
  // goal is to find the largest PREDIVA, that when multiplied by PREDIVS
  // results in a value as close as possible to the lsiMeasuredFreq. This will
  // result in the RTC receiving, as close as possible, the needed 1Hz clock.
  for (preDivA = 127; preDivA >= 2; preDivA--)
  {    
    // To be thorough check above and below our initial guess too
    initialPreDivS = (lsiTargetFreq / preDivA) + 2;   // Start above

    // Is this closest to our average frequency target (i.e. smallest
    // difference)?
    for (chkOffset = 0; chkOffset <  4; chkOffset++)
    {  
      chkDiff = (preDivA * initialPreDivS) - lsiTargetFreq;
      if(chkDiff < smallestDiff)
      {
         MEADOW_TRACE_DEBUG("*** New smallest - chkOffset:%u, A(%03u) * S(%04u) = %05lu (dif:%03u)\n",
                chkOffset, preDivA, initialPreDivS, preDivA * initialPreDivS, chkDiff);

        // Save values of the new smallest error
        smallestDiff = chkDiff;
        smallestDivA = preDivA;
        smallestDivS = initialPreDivS;

        // Did we find a perfect combination (i.e. prime factors)?
        if(smallestDiff == 0)
          break;
      }

      initialPreDivS--;   // Move down for this PREDIVA
    }

    if(smallestDiff == 0)
      break;
  }

  MEADOW_TRACE_DEBUG("Final PreDivA:%u, PreDivS:%u, (product:%u), target:%.3f\n",
            smallestDivA,
            smallestDivS,
            smallestDivA * smallestDivS,
            lsiMeasuredFreq);

  // Per STM documents a DivA of 0x7f and a DevS of 0xff is perfect for 32,768
  // HZ. And the product of 128 * 256 = 32768. Therefore, 1 must be subtracted
  // from both of the below factors to compensate for the hardware adding 1.
  *PreDivA = (uint8_t)smallestDivA - 1;
  *PreDivS = (uint16_t)smallestDivS - 1;
  return OK;
}

#endif  // #if defined (CONFIG_MEADOW_PWR_MGMT_SUPPORT)
